// Настроить проект, вывести в консоль “Hello world!”.
// Вывести в консоль системные дату и время.

package sem_1;
// import java.util.Scanner;

import java.time.LocalDateTime;

public class task1 {
    public static void main(String[] args) {
        System.out.println(LocalDateTime.now());
        System.out.println("Hello, world!");


    }
}
